content/html/meeting-notes/2012-01-19.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Meeting Notes 2012-01-19</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Meeting Notes 2012-01-19"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-04-25 15:50:29 EDT"/>
<meta name="author" content="Mishal Awadah"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="sitemap.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Meeting Notes 2012-01-19</h1>


<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-30426956-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>




<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Meeting Notes 2012-01-19</a>
<ul>
<li><a href="#sec-1-1">We enter a meditation of M-x zone.</a></li>
<li><a href="#sec-1-2">Guest lectures</a></li>
<li><a href="#sec-1-3">Editor usage</a></li>
<li><a href="#sec-1-4">Topics</a></li>
<li><a href="#sec-1-5">Administration</a></li>
<li><a href="#sec-1-6">Mobile Devices</a></li>
<li><a href="#sec-1-7">Publicity</a></li>
<li><a href="#sec-1-8">Meeting Structure</a></li>
<li><a href="#sec-1-9">Misc.</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Meeting Notes 2012-01-19</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">We enter a meditation of M-x zone.</h3>
<div class="outline-text-3" id="text-1-1">

</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">Guest lectures</h3>
<div class="outline-text-3" id="text-1-2">

<ul>
<li>Perry should give a lecture sometime. Probably not the first one though.
</li>
</ul>

</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3">Editor usage</h3>
<div class="outline-text-3" id="text-1-3">

<ul>
<li>The outbreak of vim-usage on campus is probably Sam Panzer's fault.
</li>
<li>A lot of professors use emacs.
<ul>
<li>Max Mintz uses chalk.
</li>
</ul>

</li>
<li>Andrew recounts the story of some guy.
<ul>
<li><b>Andrew</b> : Do you know what emacs does?
</li>
<li><b>Guy</b> : I know you can play tetris in it.
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4">Topics</h3>
<div class="outline-text-3" id="text-1-4">

<ul>
<li><b>Zach</b> : I wanna learn awesome shit. Also some lisp.
<ul>
<li>Zach also wants to learn how to get line numbers to work.
</li>
</ul>

</li>
<li>Andrew proposes extending to general command-line fu.
<ul>
<li><b>Zach</b> : We should just call it the neckbeard club.
</li>
</ul>

</li>
<li><b>Andrew</b> : EMACS COMMAND OF THE WEEK!
</li>
</ul>

</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5">Administration</h3>
<div class="outline-text-3" id="text-1-5">

<ul>
<li><b>John</b> : Treasury? We don't have money.
</li>
<li>John will be pressing the "send email" button.
</li>
<li><b>John</b> : Gauging interest in leadership&hellip; I'm going to do all the work,
              I think you all decided on that.
<ul>
<li>John Mayer for president!
</li>
</ul>

</li>
<li><b>John</b> : We need to add all the cool things you do to the repo.
<ul>
<li><b>Mish</b> : Add them! You said you'd do everything.
</li>
<li><b>John</b> : I'm delegating.
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6">Mobile Devices</h3>
<div class="outline-text-3" id="text-1-6">

<ul>
<li><b>Andrew</b> : They ported vim to the iPad. We should port emacs to the iPad.
</li>
<li><b>John</b> : Is the issh screen too small to do anything?
<ul>
<li><b>Andrew, Zach</b> : Yes.
</li>
<li><b>Zach</b> : You can restart your server from your phone but that's about it.
</li>
<li><b>Andrew</b> : You can also ssh in and forkbomb eniac.
<ul>
<li>John will be targeting a random 505 student with forkbombs.
</li>
</ul>

</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-1-7" class="outline-3">
<h3 id="sec-1-7">Publicity</h3>
<div class="outline-text-3" id="text-1-7">

<ul>
<li><b>Andrew</b> : We should get CJ to post to everyone in his class last semester.
</li>
<li><b>Zach</b> : I can just post on Piazza and force it to send to everyone.
</li>
<li>We will be collaboratively editing the email.
<ul>
<li><b>Mish</b> : Google doc!
</li>
<li><b>Andrew</b> : Emacs!
</li>
</ul>

</li>
<li>Copying text from emacs into gmail is inefficient, compared to sending mail from emacs.
</li>
<li><b>John</b> : I really want our motto to be Never Too Late To :q
<ul>
<li>Never use vim. If you don't have emacs, use nano, or ed.
</li>
</ul>

</li>
<li>Zach requests pizza.
<ul>
<li><b>John</b> : If we get food, then we're set.
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-1-8" class="outline-3">
<h3 id="sec-1-8">Meeting Structure</h3>
<div class="outline-text-3" id="text-1-8">

<ul>
<li>Separate meetings for beginners and power users (though anyone can come to both).
<ul>
<li><b>Mish</b> : If nobody shows up to the lecture we can just have one of our hack sessions.
</li>
</ul>

</li>
<li>We need a logo.
</li>
</ul>

</div>

</div>

<div id="outline-container-1-9" class="outline-3">
<h3 id="sec-1-9">Misc.</h3>
<div class="outline-text-3" id="text-1-9">

<ul>
<li>Some guy stops by to retreive his gloves.
</li>
<li>John registers localbriefs.com, for briefs of local news. Then he got the mental image of "local underwear."
<ul>
<li><b>John</b> : I think I could still spin it into something useful though.
</li>
</ul>

</li>
<li><b>Mish</b> : You can mark sections with C-&lt;SPC&gt; and the arrow keys.
<ul>
<li><b>Andrew</b> : What arrow keys?
</li>
</ul>

</li>
<li>Zach is already that guy who plays with M-x zone.
</li>
</ul>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-04-25 15:50:29 EDT</p>
<p class="author">Author: Mishal Awadah</p>
<p class="creator">Org version 7.8.09 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
